In [56]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [57]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [58]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [59]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [60]:
inputs = inputs.drop('Sex', axis='columns')
inputs = pd.concat([inputs, dummies], axis='columns')

In [61]:
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [62]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [63]:
inputs.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [64]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [66]:
len(X_train)

712

In [67]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [68]:
model.fit(X_train, y_train)

GaussianNB()

In [69]:
model.score(X_test, y_test)

0.8212290502793296

In [70]:
X_test[:10]

     Pclass        Age     Fare  female  male
29        3  29.699118   7.8958       0     1
315       3  26.000000   7.8542       1     0
69        3  26.000000   8.6625       0     1
0         3  22.000000   7.2500       0     1
459       3  29.699118   7.7500       0     1
849       1  29.699118  89.1042       1     0
579       3  32.000000   7.9250       0     1
787       3   8.000000  29.1250       0     1
234       2  24.000000  10.5000       0     1
224       1  38.000000  90.0000       0     1

In [71]:
y_test[:10]

29     0
315    1
69     0
0      0
459    0
849    1
579    1
787    0
234    0
224    1
Name: Survived, dtype: int64

In [72]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [73]:
model.predict_proba(X_test[:10])

array([[0.98477792, 0.01522208],
       [0.05489869, 0.94510131],
       [0.98411338, 0.01588662],
       [0.98308884, 0.01691116],
       [0.98477348, 0.01522652],
       [0.00166319, 0.99833681],
       [0.98510934, 0.01489066],
       [0.97496687, 0.02503313],
       [0.96681373, 0.03318627],
       [0.6441044 , 0.3558956 ]])